app/controllers/contribucios_controller.rb

  def index
    if !params[:userid].blank?
      @contribucios = Contribucio.where(user_id: params[:userid]).order(like: :desc)
    elsif !params[:likedid].blank?
      @contribucios = Contribucio.joins("INNER JOIN votes ON votes.contribucio_id = contribucios.id").group!("votes.user_id").having!("votes.user_id=?",current_user.id)
    else
      @contribucios = Contribucio.where(tipus: 'url').order(like: :desc)
---
SELECT "contribucios".* FROM "contribucios" WHERE "contribucios"."tipus" = ? ORDER BY "contribucios"."like" DESC  [["tipus", "url"]]

  def news
    @contribucios = Contribucio.all.order(created_at: :desc)
---
SELECT "contribucios".* FROM "contribucios" ORDER BY "contribucios"."created_at" DESC